network-tests/v5/oha-results/istio-ambient/replica-6/test-productpage.bookinfo-basic.svc-64-30000.txt
Started at 2024-05-23-15-29
Summary:
  Success rate:	100.00%
  Total:	127.7060 secs
  Slowest:	0.4666 secs
  Fastest:	0.0692 secs
  Average:	0.2722 secs
  Requests/sec:	234.9146

  Total data:	141.88 MiB
  Size/request:	4.
  Size/sec:	1.11 MiB

Response time histogram:
  0.069 [1]     |
  0.109 [11]    |
  0.149 [8]     |
  0.188 [12]    |
  0.228 [247]   |
  0.268 [13892] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.308 [13759] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.347 [1753]  |■■■■
  0.387 [272]   |
  0.427 [40]    |
  0.467 [5]     |

Response time distribution:
  10.00% in 0.2476 secs
  25.00% in 0.2574 secs
  50.00% in 0.2692 secs
  75.00% in 0.2832 secs
  90.00% in 0.3003 secs
  95.00% in 0.3143 secs
  99.00% in 0.3491 secs
  99.90% in 0.3933 secs
  99.99% in 0.4321 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 0.0001 secs, 0.0101 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0039 secs

Status code distribution:
  [200] 30000 responses
Finished at 2024-05-23-15-31